{
  "first-message": "Техника у тебя уже сильная, особенно ноги и корпус. Самое важное сейчас - сделать шаги ровнее, тогда бег станет легче и быстрее. Для тебя есть рекомендуемые упражнения!",
  "blocks": [
    {
      "id": "technique",
      "message": "Твоя техника в целом очень сильная. Но твои шаги не всегда одинаковые — из-за этого ты теряешь часть энергии. Старайся делать шаги одинаковой длины и высоты, твой бег станет легче и быстрее.",
      "data": {
        "score": 93.6,
        "level": "Профессионал",
        "metrics": [
          { "name": "Руки", "value": 94 },
          { "name": "Ноги", "value": 98 },
          { "name": "Корпус", "value": 99 },
          { "name": "Стабильность", "value": 76 }
        ]
      }
    },
    {
      "id": "focus",
      "message": "Фокус на стабильности движений — этот показатель у тебя 76/100. Также есть избыточные вертикальные колебания: ты слишком прыгаешь вверх при каждом шаге вместо движения вперёд.",
      "recommendation": "Работай над тем, чтобы каждый шаг был одинаковым. Делай рекомендуемые упражнения для коррекции 3–4 раза в неделю.",
      "estimated_improvement": "1-2 месяца"
    },
    {
      "id": "errors",
      "message": "Разберём твои ошибки подробнее — их 2.",
      "data": [
        {
          "priority": "low",
          "description": "Колено работает нестабильно, каждый шаг разный. Это снижает контроль и повышает риск травмирования."
        },
        {
          "priority": "high",
          "description": "Избыточные вертикальные колебания — ты слишком сильно прыгаешь вверх при каждом шаге вместо движения вперёд."
        }
      ]
    },
    {
      "id": "exercises",
      "message": "Рекомендованные упражнения для улучшения техники твоего бега. Выполняй их регулярно для коррекции ошибок.",
      "data": [
        {
          "id": "ex005",
          "name": "Стойка на одной ноге с закрытыми глазами",
          "description": "Встаньте прямо, перенесите вес на одну ногу и оторвите вторую от пола. Закройте глаза и удерживайте равновесие от 30 до 60 секунд. Следите за тем, чтобы опорная нога была слегка согнута в колене — это помогает стабилизировать сустав. Руки можно держать вдоль тела или слегка развести в стороны для баланса. Затем смените ногу. Выполните 3 подхода на каждую сторону. Если упражнение даётся легко, встаньте на мягкую поверхность — сложенный коврик или подушку. Упражнение тренирует проприоцепцию, укрепляет мышцы-стабилизаторы голеностопа и улучшает координацию. Выполняйте ежедневно."
        },
        {
          "id": "ex006",
          "name": "Приседания с резиновой лентой вокруг колен",
          "description": "Встаньте прямо, ноги на ширине плеч, резиновая лента надета чуть выше колен. Носки слегка развёрнуты наружу. Опускайтесь вниз, сгибая колени и отводя таз назад. Следите за тем, чтобы колени двигались строго по линии носков и не заваливались внутрь — лента создаёт сопротивление и помогает держать правильное положение. Опускайтесь до угла 90 градусов в коленях. Пятки плотно прижаты к полу, корпус держите прямо. Выполните 12–15 повторений в 3 подхода. Выполняйте 3 раза в неделю с днём отдыха между тренировками."
        },
        {
          "id": "ex007",
          "name": "Мёртвый жук",
          "description": "Лягте на спину на ровную поверхность. Поднимите руки вертикально вверх, согните ноги в коленях под углом 90 градусов — голени параллельны полу. Прижмите поясницу к полу и удерживайте её прижатой на протяжении всего упражнения. На выдохе медленно опустите правую руку назад за голову и одновременно вытяните левую ногу вперёд, почти касаясь пяткой пола. На вдохе вернитесь в исходное положение и повторите на другую сторону. Выполните 10–12 повторений на каждую сторону в 3 подхода. Выполняйте 4 раза в неделю."
        }
      ]
    }
  ]
}